package ex20221122
/**함수형 프로그래밍*/
fun main() {

    // 프로그래밍 패러다임
    // 개발자가 개발하는 데 있어서 당연하게 생각하는 패턴, 상식, 패턴
    // 대표적 예시 : 절차적 프로그래밍(C), 객체지향 프로그래밍(Java), 함수형 프로그래밍(Kotlin, JS)
    // Kotlin 은 다중 패러다임 언어 (객체지향, 함수형)
    
    // 일급 객체: 포함 관계를 갖는 데 있어서 최상위 레벨
    // ex Java : 객체(Class)지향 프로그래밍
    // Class 가 변수, 함수, 클래스(inner class) 를 품을 수 있다
    // ex Kotlin : 함수형 프로그래밍
    // 함수 안에 변수(필드), 메서드(함수), {프로퍼티}, 클래스 등을 품을 수 있다
    
    // 함수를 변수처럼 사용할 수 있어야 함수형 프로그래밍이다
    // 1) 함수 참조 (function reference)
    // 2) 람다식(lambda)
}